# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'heroku/brew'

# Binaries
brew 'asdf'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl-openssl'
brew 'ffmpeg'
brew 'gh'
brew 'git-flow'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'heroku'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'micro'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'postman'
brew 'pyenv'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zsh-syntax-highlighting'
brew 'libpq'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'nginx'
brew 'redis'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'dbngin'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'transmission'
cask 'windscribe'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Flow', id: 1423210932
